RT-Thread/rt-thread/bsp/hc32l196/Libraries/HC32L196_StdPeriph_Driver/src/hc32l196_adt.c
        case AdtTrigD:
            M0P_ADTIM4->TTRIG_f.TRIGDS = pstcAdtPortTrigCfg->enTrigSrc;
            M0P_ADTIM4->FCONR_f.NOFIENTD = pstcAdtPortTrigCfg->bFltEn;
            M0P_ADTIM4->FCONR_f.NOFICKTD = pstcAdtPortTrigCfg->enFltClk;
            break;

        default:
            return ErrorInvalidParameter;
    }

    return Ok;
}

/***********************************************************************
 * \brief
 *          CHxX端口配置
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtCHxXPort    CHxX端口
 * \param   [in]  pstcAdtCHxXCfg   CHxX端口配置指针
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 *********************************************************************/
en_result_t Adt_CHxXPortCfg(M0P_ADTIM_TypeDef *ADTx,
                                en_adt_CHxX_port_t enAdtCHxXPort,
                                stc_adt_CHxX_port_cfg_t* pstcAdtCHxXCfg)
{
    if(NULL == pstcAdtCHxXCfg)
    {
        return ErrorInvalidParameter;
    }

    switch (enAdtCHxXPort)
    {
        case AdtCHxA:
            ADTx->PCONR_f.CAPCA = pstcAdtCHxXCfg->enCap;
            ADTx->PCONR_f.STACA = pstcAdtCHxXCfg->enStaOut;
            ADTx->PCONR_f.STPCA = pstcAdtCHxXCfg->enStpOut;
            ADTx->PCONR_f.STASTPSA = pstcAdtCHxXCfg->enStaStp;
            ADTx->PCONR_f.CMPCA = pstcAdtCHxXCfg->enCmpc;
            ADTx->PCONR_f.PERCA = pstcAdtCHxXCfg->enPerc;
            ADTx->PCONR_f.OUTENA = pstcAdtCHxXCfg->bOutEn;
            ADTx->PCONR_f.DISSELA = pstcAdtCHxXCfg->enDisSel;
            ADTx->PCONR_f.DISVALA = pstcAdtCHxXCfg->enDisVal;
            ADTx->FCONR_f.NOFIENGA = pstcAdtCHxXCfg->bFltEn;
            ADTx->FCONR_f.NOFICKGA = pstcAdtCHxXCfg->enFltClk;
            break;

        case AdtCHxB:
            ADTx->PCONR_f.CAPCB = pstcAdtCHxXCfg->enCap;
            ADTx->PCONR_f.STACB = pstcAdtCHxXCfg->enStaOut;
            ADTx->PCONR_f.STPCB = pstcAdtCHxXCfg->enStpOut;
            ADTx->PCONR_f.STASTPSB = pstcAdtCHxXCfg->enStaStp;
            ADTx->PCONR_f.CMPCB = pstcAdtCHxXCfg->enCmpc;
            ADTx->PCONR_f.PERCB = pstcAdtCHxXCfg->enPerc;
            ADTx->PCONR_f.OUTENB = pstcAdtCHxXCfg->bOutEn;
            ADTx->PCONR_f.DISSELB = pstcAdtCHxXCfg->enDisSel;
            ADTx->PCONR_f.DISVALB = pstcAdtCHxXCfg->enDisVal;
            ADTx->FCONR_f.NOFIENGB = pstcAdtCHxXCfg->bFltEn;
            ADTx->FCONR_f.NOFICKGB = pstcAdtCHxXCfg->enFltClk;
            break;

        default:
            return ErrorInvalidParameter;
    }

    return Ok;
}

/************************************************************************
 * \brief
 *          使能端口刹车
 *
 * \param   [in]  port              端口
 * \param   [in]  pstcAdtBrkPtCfg   端口刹车配置指针
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 ************************************************************************/
en_result_t Adt_EnableBrakePort(uint8_t port, stc_adt_break_port_cfg_t* pstcAdtBrkPtCfg)
{
    uint32_t u32Val;

    if (NULL == pstcAdtBrkPtCfg)
    {
        return ErrorInvalidParameter;
    }

    u32Val = M0P_ADTIM4->PTBKP;
    u32Val &= ~(1u<<port);
    M0P_ADTIM4->PTBKP = u32Val | (pstcAdtBrkPtCfg->enPol<<port);

    u32Val = M0P_ADTIM4->PTBKS;
    M0P_ADTIM4->PTBKS = u32Val | (1u<<port);

    return Ok;
}

/**********************************************************************
 * \brief
 *          清除端口刹车
 *
 * \param   none
 *
 * \retval  none
 **********************************************************************/
void Adt_ClearBrakePort(void)
{
    M0P_ADTIM4->PTBKS = 0;
}

/*********************************************************************
 * \brief
 *          无效条件3配置
 *
 * \param   [in]  pstcAdtDisable3   无效条件3配置指针
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 ********************************************************************/
en_result_t Adt_Disable3Cfg(stc_adt_disable_3_cfg_t* pstcAdtDisable3)
{
    uint8_t i;

    if (NULL == pstcAdtDisable3)
    {
        return ErrorInvalidParameter;
    }

    Adt_ClearBrakePort();
    for (i = 0; i <= ADTIM_PORT_BKE_NUM; i++)
    {
        if (TRUE == pstcAdtDisable3->stcBrkPtCfg[i].bPortEn)
        {
            Adt_EnableBrakePort(i, &pstcAdtDisable3->stcBrkPtCfg[i]);
        }
    }

    M0P_ADTIM4->AOSSR_f.BFILTEN = pstcAdtDisable3->bFltEn;
    M0P_ADTIM4->AOSSR_f.BFILTS = pstcAdtDisable3->enFltClk;

    return Ok;
}

/*********************************************************************
 * \brief   软件刹车 Enable/Disable(仅适用于无效条件3使能的情况下)
 *
 * \param   [in]  bSwBrk           软件刹车使能/禁止
 *
 * \retval  en_result_t  Ok:  配置成功
 ********************************************************************/
en_result_t Adt_SwBrake(boolean_t bSwBrk)
{
    M0P_ADTIM4->AOSSR_f.SOFTBK = bSwBrk;

    return Ok;
}

/*******************************************************************
 * \brief
 *          获取端口刹车标志
 *
 * \param   none
 *
 * \retval  TRUE or FALSE
 ******************************************************************/
boolean_t Adt_GetPortBrakeFlag(void)
{
    return M0P_ADTIM4->AOSSR_f.FBRAKE;
}

/******************************************************************
 * \brief
 *          清除端口刹车标志
 *
 * \param   none
 *
 * \retval  none
 ******************************************************************/
void Adt_ClearPortBrakeFlag(void)
{
    M0P_ADTIM4->AOSCL_f.FBRAKE = 0;
}

/********************************************************************
 * \brief
 *          无效条件1配置
 *
 * \param   [in]  pstcAdtDisable1   无效条件1配置指针
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 ********************************************************************/
en_result_t Adt_Disable1Cfg(stc_adt_disable_1_cfg_t* pstcAdtDisable1)
{

    if (NULL == pstcAdtDisable1)
    {
        return ErrorInvalidParameter;
    }

    M0P_ADTIM4->AOSSR_f.SMH2 = pstcAdtDisable1->bTim6OutSH;
    M0P_ADTIM4->AOSSR_f.SMH1 = pstcAdtDisable1->bTim5OutSH;
    M0P_ADTIM4->AOSSR_f.SMH0 = pstcAdtDisable1->bTim4OutSH;
    M0P_ADTIM4->AOSSR_f.SML2 = pstcAdtDisable1->bTim6OutSL;
    M0P_ADTIM4->AOSSR_f.SML1 = pstcAdtDisable1->bTim5OutSL;
    M0P_ADTIM4->AOSSR_f.SML0 = pstcAdtDisable1->bTim4OutSL;

    return Ok;
}

